<template>
    <div>
        <section class="offer">
            <div class="container">
                <a href="#" id="scroll" v-scroll-to="{ el: '#' + id, onDone:onScrollDone}" >{{name}}</a>
                <p>
                    Для регистрации в системе от вас требуется согласие с публичной офертой.
                </p>

                <div style="text-align: center">
                    <p>Публичная оферта Службы заказа грузчиков и разнорабочих «Арбайт»</p>
                    <p>Индивидуальный предприниматель Фёдоров Дмитрий Сергеевич</p>
                </div>

                <div v-if="user_type == 'w'">
                    <ol>
                        <li><span class="offer-bold">Общие положения</span>
                            <ol class="offer-sub">
                                <li>Данный документ, адресованный физическим и юридическим лицам (далее — Заказчики), а
                                    также лицам, которые самостоятельно оказывают услуги по
                                    грузоперевозкам, погрузо-разгрузочным работам, услуги разнорабочих (далее – Партнёры)
                                    является официальным предложением Службы заказа грузчиков и
                                    разнорабочих «Арбайт» (Индивидуальный предприниматель Фёдоров Дмитрий Сергеевич) (далее
                                    — Служба) и содержит все существенные условия
                                    предоставления Службой информационных услуг, направленных на внесение заказа Заказчика в
                                    информационную базу Службы, предоставление информации о
                                    заказе Партнёрам, информирование Заказчика о Партнёре, выбравшем заказ к исполнению.
                                </li>
                                <li>В соответствии со статьей 437 Гражданского кодекса Российской Федерации данный документ
                                    является публичной офертой.
                                    Предоставление Заказчиком информации о заказе услуг Службе, регистрация Партнёра в
                                    информационной базе Службы в качестве лица, оказывающего услуги
                                    по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих
                                    являются акцептом настоящей оферты, что считается равносильным
                                    заключению договора на изложенных в ней условиях.
                                    Оферта с приложениями размещена в следующих группах мессенджера «WhatsApp»: «Арбайт
                                    грузчики/рабочие»; «Арбайт2 грузчики/рабочие»; «Арбайт3
                                    грузчики/рабочие»; «Арбайт4 грузчики/рабочие».
                                    Также оферта размещена по следующему адресу в сети Интернет: __________________________
                                    .
                                </li>
                                <li>Заказчики и Партнёры обязаны внимательно ознакомиться с полным текстом настоящей
                                    оферты и принять её положения в полном объёме и неизменном виде. В случае, если
                                    Заказчик или Партнёр не согласны с какими-либо её условиями полностью или в части,
                                    последние обязаны отказаться от услуг данной Службы.
                                </li>
                                <li>Определения, используемые в целях выполнения условий настоящей оферты:
                                    <ol>
                                        <li>Услуги — информационные услуги, предоставляемые Службой, направленные на прием
                                            информации о заказе от Заказчика; обработку и передачу
                                            информации о заказе Партнёру; информирование Заказчика о Партнёре, выбравшем
                                            заказ к исполнению. Служба не оказывает Заказчикам услуги по
                                            грузоперевозкам, погрузо-разгрузочным работам, услуги разнорабочих. Служба не
                                            оказывает Заказчикам и Партнёрам никаких иных услуг, кроме
                                            услуг по предоставлению информации (информационных).
                                        </li>
                                        <li>Заказ — внесённая в информационную базу Службы информация о заказе Заказчика на
                                            услуги, оказываемые Партнёрами.
                                        </li>
                                        <li>Партнёр — лицо, самостоятельно, своими силами или силами привлекаемых им специалистов,
                                            оказывающее Заказчику услуги по грузоперевозкам и (или)
                                            погрузо-разгрузочным работам, а также (или) услуги разнорабочих.
                                        </li>
                                        <li>Заказчик — лицо, осуществляющее заказ услуг Партнёров по грузоперевозкам и (или)
                                            погрузо-разгрузочным работам, и (или) услуги разнорабочих
                                            с информационной помощью Службы.
                                        </li>
                                        <li>Маршрут — путь следования транспортного средства между пунктами отправления и
                                            назначения.
                                        </li>
                                        <li>Информационная база Службы – совокупность информации о заказах Заказчиков и
                                            Партнёрах, оказывающих услуги по грузоперевозкам и (или)
                                            погрузо-разгрузочным работам, и (или) услуги разнорабочих; содержащаяся на
                                            информационных площадках Службы, в частности, в следующих
                                            группах мессенджера «WhatsApp»: «Арбайт грузчики/рабочие»; «Арбайт2
                                            грузчики/рабочие»; «Арбайт3 грузчики/рабочие»; «Арбайт200
                                            грузчики/рабочие».
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Предмет оферты</span>
                            <ol class="offer-sub">
                                <li>Служба безвозмездно оказывает Заказчику информационные услуги, направленные на внесение
                                    заказа в информационную базу Службы и информирование
                                    Заказчика о Партнёре, принявшем заказ к исполнению. Служба самостоятельно не оказывает
                                    Заказчику услуги по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>
                                    Служба на возмездной основе оказывает информационные услуги Партнёру по предоставлению
                                    информации Партнёру о заказе Заказчика, по предоставлению
                                    Заказчику информации о Партнёре, принявшем заказ к исполнению.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Порядок оказания услуг</span>
                            <ol class="offer-sub">
                                <li>
                                    Акцепт Заказчиком условий настоящей оферты осуществляется путём обращения в Службу любым
                                    доступным способом, в электронном виде, нарочно или по средствам почтового направления в
                                    письменном виде, с целью размещения информации о заказе
                                    услуг по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуг
                                    разнорабочих.
                                </li>
                                <li>Акцепт Партнёром условий настоящей оферты осуществляется путём обращения в Службу любым
                                    доступным, указанным в п. 1 настоящей статьи способом,
                                    способом с целью регистрации в информационной базе Службы в качестве лица,
                                    оказывающего услуги по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или)
                                    услуги разнорабочих.
                                </li>
                                <li>Заказчик полностью несёт ответственность за содержание и достоверность информации, предоставленной
                                    при размещении заказа.
                                </li>
                                <li>Партнёр полностью несёт ответственность за содержание и достоверность информации, предоставленной
                                    при регистрации в информационной базе Службы в качестве Партнёра, оказывающего услуги по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>Служба безвозмездно размещает информацию о заказе Заказчика в информационной базе
                                    Службы и на возмездной основе предоставляет доступ к данной информации Партнёру,
                                    который принимает заказ к исполнению, уведомляет о своем выборе Службу,
                                    оплачивает информационные услуги Службы в определённом Службой размере процента от
                                    общей суммы оплаты Партнёру от Заказчика
                                    за исполнение заказа. При этом Служба гарантирует исключительно оказание вышеуказанных
                                    информационных услуг. Ответственность за осуществление услуг (объём, качество и
                                    сроки его исполнения, прочие условия) по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуг разнорабочих полностью несёт Партнёр,
                                    принявший заказ Заказчика к исполнению.
                                </li>
                                <li>Служба имеет право отказать в предоставлении информационных услуг Заказчикам и
                                    Партнёрам,
                                    выражающим несогласие полностью или в части с условиями настоящей оферты, или не
                                    надлежащим образом исполняющим (не исполняющим) её условия.
                                </li>
                                <li>В целях внутреннего контроля деятельности Службы и контроля качества предоставления
                                    Службой
                                    информационных услуг переговоры между Заказчиком и Службой, Партнёром и Службой могут
                                    записываться.
                                </li>
                                <li>Заказчик может проинформировать Службу о случаях нарушения Партнёром своих прав. В этом
                                    случае Служба может безвозмездно оказать Заказчику дополнительные информационные услуги,
                                    а
                                    именно: уведомляет Партнёра о поступившей от Заказчика претензии и о её содержании,
                                    сообщает
                                    Партнёру контактный номер телефона Заказчика, сообщает Заказчику контактный номер
                                    телефона
                                    Партнёра. Дальнейшее урегулирование спорной ситуации осуществляется между Заказчиком и
                                    Партнёром без участия Службы. Содержание настоящего пункта не свидетельствует и не может
                                    расцениваться как принятие Службой на себя каких-либо обязательств по возмещению
                                    Заказчику
                                    вреда, причинённого действиями или бездействием Партнёра, в натуральной или денежной
                                    форме,
                                    выплате компенсаций и (или) принятие Службой на себя иных обязанностей, не
                                    предусмотренных
                                    настоящей офертой.
                                </li>
                                <li>При сборе и обработке персональных данных Заказчиков и Партнёров Служба руководствуется
                                    положениями Федерального закона от 27 июля 2006 года № 152 «О персональных данных».
                                    Согласно
                                    п.5 ч.1 ст.6 данного Федерального закона, не требуется получать согласие Заказчиков и
                                    Партнёров на сбор и обработку их персональных данных Службой, так как персональные
                                    данные
                                    Заказчиков и Партнёров собираются и обрабатываются Службой только в целях исполнения
                                    обязательств Службы перед Заказчиками и Партнёрами, а также обязательств Заказчиков и
                                    партнёров перед Службой, возникших на основе акцепта настоящей публичной оферты.
                                    Персональные данные собираются и обрабатываются Службой в следующем составе: фамилия,
                                    имя,
                                    отчество, дата рождения, адрес места жительства, номер сотового телефона.
                                </li>
                                <li>Деятельность Службы по сбору, хранению, систематизации информации, формированию
                                    информационной базы Службы, а также правоотношения между Партнером и Службой по
                                    предоставлению доступа к информационной базе Службы осуществляются в соответствии с
                                    положениями Федерального закона от 27.07.2006 г. № 149-ФЗ «Об информации, информационных
                                    технологиях и о защите информации».
                                </li>
                                <li>В соответствии со ст. 7, ст. 9 Федерального закона «Об информации, информационных
                                    технологиях и о защите информации» информация, размещенная в информационной базе Службы,
                                    является общедоступной, свободно свободно обращаемой и распространяемой.
                                    Такая информация не отнесена действующим законодательством Российской Федерации к
                                    к индивидуальной (персональной), ограниченной или запрещенной к распространению.
                                </li>
                                <li>Информационную базу Службы образуют следующие материалы:
                                    Актуальная информация о существующей потребности в услугах по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услугах разнорабочих.
                                </li>
                                <li>Материалы, образующие информационную базу Службы, имеют следующие характеристики:
                                    <ol>
                                        <li>Данные о существующей потребности в услуге по грузоперевозкам:
                                            <ol>
                                                <li>адрес места подачи автомобиля;</li>
                                                <li>вид груза;</li>
                                                <li>адрес места окончания поездки или расстояние доставки;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                        <li>Данные о существующей потребности в услуге по погрузо-разгрузочным работам:
                                            <ol>
                                                <li>адрес (адреса) погрузо-разгрузочных работ;</li>
                                                <li>вид груза;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                        <li>Данные о существующей потребности в услугах разнорабочих:
                                            <ol>
                                                <li>вид и описание работ;</li>
                                                <li>адрес производства работ;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                    </ol>
                                </li>
                                <li>Территория, на которой предоставляется право использования информации, — Российская
                                    Федерация.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Порядок регистрации в информационной базе Службы</span>
                            <ol class="offer-sub">
                                <li>Для получения доступа к информационной базе Службы Партнёру необходимо пройти процедуру
                                    регистрации на информационных площадках Службы, в частности, в одной из следующих групп
                                    мессенджера «WhatsApp»: «Арбайт грузчики/рабочие»; «Арбайт2 грузчики/рабочие»;
                                    «Арбайт Приоритет»; «Арбайт Штрафбат». Регистрацию Партнёр может пройти по
                                    месту нахождения офиса Службы при личном обращении или самостоятельно с использованием
                                    сети Интернет.
                                </li>
                                <li>Регистрация Партнёра на информационных площадках Службы подтверждает полное и
                                    безоговорочное принятие всех условий настоящей оферты в неизменном виде.
                                </li>
                                <li>Регистрация Партнёра осуществляется посредством предоставления сведений о себе по месту
                                    нахождения офиса Службы или удалённо с использованием сети Интернет. Предоставление
                                    сведений
                                    Партнёром удалённо с использованием сети Интернет осуществляется путём направления
                                    Партнёром
                                    со своего телефонного номера с помощью Интернет-мессенджера WhatsApp на телефонный номер
                                    Службы (Индивидуального предпринимателя Фёдорова Дмитрия Сергеевича) +7 951 000 22 34
                                    электронного сообщения с подтверждением принятия условий настоящей оферты, а также с
                                    сообщением своих данных в следующем объёме: фамилия, имя, отчество, дата рождения, адрес
                                    места жительства, номер сотового телефона. В процессе регистрации Служба имеет право попросить
                                    Партнёра предоставить документы (электронные образы (сканы) документов), подтверждающие
                                    достоверность указанных сведений.
                                </li>
                                <li>Регистрация осуществляется исключительно по усмотрению Службы.
                                    Предоставление документов и сведений, необходимых для регистрации,
                                    не влечет за собой безусловную обязанность Службы
                                    произвести регистрацию Партнёра.
                                </li>
                                <li>Процедура регистрации завершается и подтверждается внесением в информационную базу
                                    Службы
                                    информации о Партнёре, как о лице самостоятельно, своими силами оказывающему услуги по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>Копии и (или) электронные образы документов в процессе регистрации Служба истребует
                                    исключительно в целях проверки достоверности предоставляемых
                                    сведений и не сохраняет после завершения процедуры регистрации.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Осуществление расчётов между Заказчиком и Партнёром</span>
                            <ol class="offer-sub">
                                <li>Служба предоставляет Заказчику услуги, предмет которых определён настоящей офертой, на
                                    безвозмездной основе.
                                </li>
                                <li>Расчёт за оказание услуг по грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или)
                                    услуг разнорабочих осуществляется непосредственно между Заказчиком и Партнёром самостоятельно.
                                    Служба информирует Заказчика о стоимости оказания услуг. Указанная стоимость рассчитывается на
                                    основании тарифов, применяемых Партнёром, принявшим заказ к исполнению. Информирование
                                    Заказчика об окончательной стоимости услуг не свидетельствует и не может расцениваться как
                                    предоставление Службой услуг по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуг
                                    разнорабочих. Служба не несет и не может нести ответственность за достоверность окончательной
                                    стоимости услуг Партнёра, в связи с тем, что ответственность за указанное полностью возлагается
                                    исключительно на самого Партнёра Службы.
                                </li>
                                <li>Форма осуществления расчетов за оказание услуг по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуг разнорабочих согласуется непосредственно
                                    Заказчиком и Партнёром без участия Службы.
                                </li>
                                <li>Служба не даёт Заказчику и Партнеру каких-либо указаний относительно формы и порядка
                                    расчетов за оказанные услуги по грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или) услуг разнорабочих.
                                </li>
                                <li>Служба может обеспечить техническую возможность для оплаты Заказчиком услуг Партнёра по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или) услуг разнорабочих в форме безналичного платежа (при наличии технической
                                    возможности).
                                </li>
                                <li>При расчетах между Заказчиком и Партнёром безналичным платежом Служба может выступать в
                                    качестве агента Партнёра, действующего от имени и за счет
                                    Партнёра, в части приёма денежных средств Заказчика. Служба может принять на себя
                                    обязательства агента Партнера только в части обеспечения приёма
                                    денежных средств Заказчика.
                                </li>
                                <li>Оплата безналичным платежом может осуществляться посредством кредитных или дебетовых
                                    карт платёжных систем Visa, MasterCard, «Мир» или переводом
                                    на расчётный счёт.
                                </li>
                                <li>Оплата безналичным платежом с использованием банковских карт осуществляется в
                                    соответствии с правилами международных платежных систем на принципах
                                    соблюдения конфиденциальности и безопасности совершения платежа. Безопасность
                                    предоставляемых Заказчиком данных обеспечивается соответствием
                                    процедур требованиям стандарта безопасности данных индустрии платежных карт (Payment
                                    Card Industry Data Security Standard), и никто, включая
                                    Службу, не может их получить. Ввод данных банковской карты осуществляется на защищенной
                                    платежной странице банка-эквайера, обеспечивающего
                                    возможность безналичной оплаты услуг.
                                </li>
                                <li>В случае изменения Заказчиком объема заказанных Партнёру услуг (изменение маршрута,
                                    объёма погрузо-разгрузочных или иных работ, оказание Партнёром
                                    Заказчику дополнительных платных услуг и т.д.) стоимость подлежит перерасчету. Заказ
                                    оплачивается Заказчиком в соответствии с объёмом фактически
                                    оказанных Партнёром услуг.
                                </li>
                                <li>Заказчик и Партнёр вправе согласовать любые формы расчетов за оказание услуг по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или)
                                    услуг разнорабочих, в том числе, оплату услуг наличными денежными средствами и иными
                                    способами, не противоречащими действующему законодательству.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Осуществление расчётов между Партнёром и Службой</span>
                            <ol class="offer-sub">
                                <li>Оплата информационных услуг Службы осуществляется Партнёром в размере определённого
                                    процента
                                    от общей суммы оплаты Партнёру от Заказчика за исполнение заказа.
                                </li>
                                <li>Размер процента определяется Службой индивидуально по каждому заказу и сообщается
                                    Службой
                                    Партнёрам одновременно с размещением информации о заказе Заказчика в информационной базе
                                    Службы.
                                </li>
                                <li>Партнёр, принявший заказ Заказчика к исполнению с помощью информационных услуг Службы,
                                    одновременно принимает на себя обязательство оплатить информационные услуги Службы в
                                    определённом Службой размере процента от общей суммы оплаты Партнёру от Заказчика за
                                    исполнение заказа.
                                </li>
                                <li>Партнёр, который принимает заказ к исполнению, уведомляет о своем выборе Службу, после
                                    чего
                                    оплачивает информационные услуги Службы в определённом Службой размере процента от общей
                                    суммы оплаты Партнёру от Заказчика за исполнение заказа. После поступления оплаты от
                                    Партнёра за предоставление информационных услуг по заказу Служба предоставляет Партнёру
                                    контактную информацию Заказчика, а также информирует Заказчика о Партнёре, принявшем
                                    заказ к
                                    исполнению.
                                </li>
                                <li>Оплата информационных услуг может производиться Партнёром Службе как в наличном, так и в
                                    безналичном порядке.
                                </li>
                                <li>Оплата безналичным платежом может осуществляться посредством кредитных или дебетовых
                                    карт
                                    платёжных систем Visa, MasterCard, «Мир» или переводом на расчётный счёт Службы.
                                </li>
                                <li>Оплата безналичным платежом с использованием банковских карт осуществляется в
                                    соответствии с правилами международных платежных систем на принципах
                                    соблюдения конфиденциальности и безопасности совершения платежа. Безопасность
                                    предоставляемых Партнёром данных обеспечивается соответствием
                                    процедур требованиям стандарта безопасности данных индустрии платежных карт (Payment
                                    Card Industry Data Security Standard), и никто, включая
                                    Службу, не может их получить. Ввод данных банковской карты осуществляется на защищенной
                                    платежной странице банка-эквайера, обеспечивающего
                                    возможность безналичной оплаты услуг.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Ответственность Сторон</span>
                            <ol class="offer-sub">
                                <li>Стороны несут ответственность за невыполнение своих обязательств в соответствии с
                                    законодательством Российской Федерации и условиями настоящей оферты.
                                </li>
                                <li>Служба не несёт ответственность за перерывы в оказании услуг в случае сбоев программного
                                    обеспечения или оборудования, обеспечивающего доступ к сети Интернет.
                                </li>
                                <li>Служба не несёт ответственность за полные или частичные прерывания оказания услуг,
                                    связанные
                                    с заменой оборудования, программного обеспечения или проведением других работ, вызванных
                                    необходимостью поддержания работоспособности и развития технических средств Службы.
                                </li>
                                <li>Служба не несёт ответственность за прямые убытки, упущенную выгоду, понесённые
                                    Заказчиком в
                                    результате пользования услугами Партнёров по грузоперевозкам и (или)
                                    погрузо-разгрузочным
                                    работам, и (или) услугами разнорабочих.
                                </li>
                                <li>Служба не несёт ответственность за неисполнение Партнёром своих обязательств перед
                                    Заказчиком.
                                </li>
                                <li>Регистрация Партнёра в информационной базе Службы может быть прекращена Службой в
                                    следующих
                                    случаях:
                                    <ol>
                                        <li>если Партнёр не исполнил принятый к исполнению заказ Заказчика;</li>
                                        <li>если Партнёр допустил некорректное поведение (неуважительное отношение,
                                            грубость,
                                            ненормативная лексика) по отношению к сотрудникам Службы и (или) Заказчику;
                                        </li>
                                        <li>если Партнёр не оплатил информационные услуги Службы в определённом Службой
                                            размере процента от общей суммы оплаты Партнёру от Заказчика
                                            за исполнение заказа.
                                        </li>
                                    </ol>
                                    В случае прекращения регистрации по данным основаниям регистрация Партнёра может быть
                                    восстановлена Службой в случае принятия Партнёром на себя
                                    обязательства не допускать таких действий (бездействия) в дальнейшем; а также в случае
                                    полной оплаты Партнёром оказанных ему ранее информационных
                                    услуг Службы. Восстановление регистрации в информационной базе Службы осуществляется на
                                    возмездной основе и оплачивается Партнёром в сумме 400 руб.
                                </li>
                                <li>В случае наличия уважительных причин невозможности исполнить в назначенное время заказ
                                    Заказчика, принятый Партнёром к исполнению, Партнёр должен
                                    заблаговременно сообщить об этом Заказчику и Службе, чтобы Служба имела возможность
                                    повторно внести информацию о заказе Заказчика в информационную
                                    систему и обеспечить возможность другим Партнёрам принять заказ Заказчика к исполнению.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Ответственность Сторон</span>
                            <ol class="offer-sub">
                                <li>Порядок изменения и расторжения договора, разрешения споров</li>
                                <li>Договор, заключённый путём акцепта настоящей оферты, может быть изменён или расторгнут
                                    по
                                    соглашению Сторон.
                                </li>
                                <li>Ситуации, не урегулированные настоящей офертой, разрешаются в соответствии с действующим
                                    законодательством Российской Федерации.
                                </li>
                                <li>Споры и разногласия, связанные с исполнением настоящей оферты, Стороны будут разрешать
                                    путем
                                    переговоров.
                                </li>
                                <li>В случае невозможности урегулирования споров путем переговоров они подлежат разрешению в
                                    соответствии с действующим законодательством Российской
                                    Федерации.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Дополнительные условия</span>
                            <ol class="offer-sub">
                                <li>Соглашаясь с условиями оферты в настоящей редакции, Заказчики и Партнёры выражают свое
                                    согласие на получение информационных сообщений, а также
                                    рекламной информации (в том числе, посредством сообщений через интернет-мессенджеры),
                                    распространяемой по сетям связи в целях и случаях, когда
                                    необходимость такого согласия предусмотрена законодательством Российской Федерации о
                                    рекламе.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </div>

                <div v-if="user_type == 'd'">
                    <ol>
                        <li><span class="offer-bold">Общие положения</span>
                            <ol class="offer-sub">
                                <li>Данный документ, адресованный физическим и юридическим лицам (далее — Заказчики), а
                                    также лицам, которые самостоятельно оказывают услуги по грузоперевозкам, погрузо-разгрузочным
                                    работам, услуги разнорабочих (далее – Партнёры) является официальным предложением Службы заказа
                                    грузчиков и разнорабочих «Арбайт» (Индивидуальный предприниматель Фёдоров Дмитрий Сергеевич)
                                    (далее — Служба) и содержит все существенные условия предоставления Службой информационных
                                    услуг, направленных на внесение заказа Заказчика в информационную базу Службы, предоставление
                                    информации о заказе Партнёрам, информирование Заказчика о Партнёре, выбравшем заказ к
                                    исполнению.
                                </li>
                                <li>В соответствии со статьей 437 Гражданского кодекса Российской Федерации данный
                                    документ является публичной офертой. Предоставление Заказчиком информации о заказе услуг Службе,
                                    регистрация Партнёра в информационной базе Службы в качестве лица, оказывающего услуги по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих являются акцептом
                                    настоящей оферты, что считается равносильным заключению договора на изложенных в ней условиях.
                                    Оферта с приложениями размещена в следующих группах мессенджера «WhatsApp»: «Арбайт
                                    грузчики/рабочие»; «Арбайт2 грузчики/рабочие»; «Арбайт3 грузчики/рабочие»; «Арбайт4
                                    грузчики/рабочие». Также оферта размещена по следующему адресу в сети Интернет:
                                    http://arbait.in/offer/d/o.
                                </li>
                                <li>Заказчики и Партнёры обязаны внимательно ознакомиться с полным текстом настоящей
                                    оферты и принять её положения в полном объёме и неизменном виде. В случае, если Заказчик или
                                    Партнёр не согласны с какими-либо её условиями полностью или в части, последние обязаны отказаться
                                    от услуг данной Службы.
                                </li>
                                <li>Определения, используемые в целях выполнения условий настоящей оферты:
                                    <ol>
                                        <li>Услуги — информационные услуги, предоставляемые Службой, направленные на прием
                                            информации о заказе от Заказчика; обработку и передачу
                                            информации о заказе Партнёру; информирование Заказчика о Партнёре, выбравшем
                                            заказ к исполнению. Служба не оказывает Заказчикам услуги по
                                            грузоперевозкам, погрузо-разгрузочным работам, услуги разнорабочих. Служба не
                                            оказывает Заказчикам и Партнёрам никаких иных услуг, кроме
                                            информационных услуг.
                                        </li>
                                        <li>Заказ — внесённая в информационную базу Службы информация о заказе Заказчика на
                                            услуги, оказываемые Партнёрами.
                                        </li>
                                        <li>Партнёр — лицо, самостоятельно, своими силами оказывающее Заказчику услуги по
                                            грузоперевозкам и (или) погрузо-разгрузочным работам, и (
                                            или) услуги разнорабочих.
                                        </li>
                                        <li>Заказчик — лицо, осуществляющее заказ услуг Партнёров по грузоперевозкам и (или)
                                            погрузо-разгрузочным работам, и (или) услуги разнорабочих
                                            с информационной помощью Службы.
                                        </li>
                                        <li>Маршрут — путь следования транспортного средства между пунктами отправления и
                                            назначения.
                                        </li>
                                        <li>Информационная база Службы – совокупность информации о заказах Заказчиков и
                                            Партнёрах, оказывающих услуги по грузоперевозкам и (или)
                                            погрузо-разгрузочным работам, и (или) услуги разнорабочих; содержащаяся на
                                            информационных площадках Службы, в частности, в следующих
                                            группах мессенджера «WhatsApp»: «Арбайт грузчики/рабочие»; «Арбайт2
                                            грузчики/рабочие»; «Арбайт3 грузчики/рабочие»; «Арбайт200
                                            грузчики/рабочие».
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Предмет оферты</span>
                            <ol class="offer-sub">
                                <li>Служба безвозмездно оказывает Заказчику информационные услуги, направленные на внесение
                                    заказа в информационную базу Службы и информирование
                                    Заказчика о Партнёре, принявшем заказ к исполнению. Служба самостоятельно не оказывает
                                    Заказчику услуги по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>
                                    Служба на возмездной основе оказывает информационные услуги Партнёру по предоставлению
                                    информации Партнёру о заказе Заказчика, по предоставлению
                                    Заказчику информации о Партнёре, принявшем заказ к исполнению.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Порядок оказания услуг</span>
                            <ol class="offer-sub">
                                <li>
                                    Акцепт Заказчиком условий настоящей оферты осуществляется путём обращения в Службу любым
                                    доступным способом с целью размещения информации о заказе
                                    услуг по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуг
                                    разнорабочих.
                                </li>
                                <li>Акцепт Партнёром условий настоящей оферты осуществляется путём обращения в Службу любым
                                    доступным способом с целью регистрации в информационной базе Службы в качестве лица,
                                    оказывающего услуги по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или)
                                    услуги
                                    разнорабочих.
                                </li>
                                <li>Заказчик несёт ответственность за содержание и достоверность информации, предоставленной
                                    при
                                    размещении заказа.
                                </li>
                                <li>Партнёр несёт ответственность за содержание и достоверность информации, предоставленной
                                    при
                                    регистрации в информационной базе Службы в качестве Партнёра, оказывающего услуги по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>Служба безвозмездно размещает информацию о заказе Заказчика в информационной базе Службы
                                    и
                                    на возмездной основе предоставляет доступ к данной информации Партнёру, который
                                    принимает
                                    заказ к исполнению, уведомляет о своем выборе Службу, оплачивает информационные услуги
                                    Службы в определённом Службой размере процента от общей суммы оплаты Партнёру от
                                    Заказчика
                                    за исполнение заказа. При этом Служба гарантирует исключительно оказание вышеуказанных
                                    информационных услуг. Ответственность за осуществление услуг по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуг разнорабочих несёт Партнёр, принявший заказ
                                    Заказчика к исполнению.
                                </li>
                                <li>Служба имеет право отказать в предоставлении информационных услуг Заказчикам и
                                    Партнёрам,
                                    выражающим несогласие с условиями настоящей оферты, или неисполняющим (ненадлежащее
                                    исполняющим) её условия.
                                </li>
                                <li>В целях внутреннего контроля деятельности Службы и контроля качества предоставления
                                    Службой
                                    информационных услуг переговоры между Заказчиком и Службой, Партнёром и Службой могут
                                    записываться.
                                </li>
                                <li>Заказчик может проинформировать Службу о случаях нарушения Партнёром своих прав. В этом
                                    случае Служба может безвозмездно оказать Заказчику дополнительные информационные услуги,
                                    а
                                    именно: уведомляет Партнёра о поступившей от Заказчика претензии и о её содержании,
                                    сообщает
                                    Партнёру контактный номер телефона Заказчика, сообщает Заказчику контактный номер
                                    телефона
                                    Партнёра. Дальнейшее урегулирование спорной ситуации осуществляется между Заказчиком и
                                    Партнёром без участия Службы. Содержание настоящего пункта не свидетельствует и не может
                                    расцениваться как принятие Службой на себя каких-либо обязательств по возмещению
                                    Заказчику
                                    вреда, причинённого действиями или бездействием Партнёра, в натуральной или денежной
                                    форме,
                                    выплате компенсаций и (или) принятие Службой на себя иных обязанностей, не
                                    предусмотренных
                                    настоящей офертой.
                                </li>
                                <li>При сборе и обработке персональных данных Заказчиков и Партнёров Служба руководствуется
                                    положениями Федерального закона от 27 июля 2006 года № 152 «О персональных данных».
                                    Согласно
                                    п.5 ч.1 ст.6 данного Федерального закона, не требуется получать согласие Заказчиков и
                                    Партнёров на сбор и обработку их персональных данных Службой, так как персональные
                                    данные
                                    Заказчиков и Партнёров собираются и обрабатываются Службой только в целях исполнения
                                    обязательств Службы перед Заказчиками и Партнёрами, а также обязательств Заказчиков и
                                    партнёров перед Службой, возникших на основе акцепта настоящей публичной оферты.
                                    Персональные данные собираются и обрабатываются Службой в следующем объёме: фамилия,
                                    имя,
                                    отчество, дата рождения, адрес места жительства, номер сотового телефона.
                                </li>
                                <li>Деятельность Службы по сбору, хранению, систематизации информации, формированию
                                    информационной базы Службы, а также правоотношения между Партнером и Службой по
                                    предоставлению доступа к информационной базе Службы осуществляются в соответствии с
                                    положениями Федерального закона от 27.07.2006 г. № 149-ФЗ «Об информации, информационных
                                    технологиях и о защите информации».
                                </li>
                                <li>В соответствии со ст. 7, ст. 9 Федерального закона «Об информации, информационных
                                    технологиях и о защите информации» информация, размещенная в информационной базе Службы,
                                    является общедоступной, свободно распространяемой. Информация не отнесена действующим
                                    законодательством Российской Федерации к ограниченной или запрещенной к распространению.
                                </li>
                                <li>Информационную базу Службы образуют следующие материалы:
                                    Актуальная информация о существующей потребности в услугах по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услугах разнорабочих.
                                </li>
                                <li>Материалы, образующие информационную базу Службы, имеют следующие характеристики:
                                    <ol>
                                        <li>Данные о существующей потребности в услуге по грузоперевозкам:
                                            <ol>
                                                <li>адрес места подачи автомобиля;</li>
                                                <li>вид груза;</li>
                                                <li>адрес места окончания поездки или расстояние доставки;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                        <li>Данные о существующей потребности в услуге по погрузо-разгрузочным работам:
                                            <ol>
                                                <li>адрес (адреса) погрузо-разгрузочных работ;</li>
                                                <li>вид груза;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                        <li>Данные о существующей потребности в услугах разнорабочих:
                                            <ol>
                                                <li>вид и описание работ;</li>
                                                <li>адрес производства работ;</li>
                                                <li>тариф Партнёра, принявшего заказ к исполнению;</li>
                                                <li>расчетная стоимость услуги;</li>
                                                <li>контактная информация Заказчика.</li>
                                            </ol>
                                        </li>
                                    </ol>
                                </li>
                                <li>Территория, на которой предоставляется право использования информации, — Российская
                                    Федерация.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Порядок регистрации в информационной базе Службы</span>
                            <ol class="offer-sub">
                                <li>Для получения доступа к информационной базе Службы Партнёру необходимо пройти процедуру
                                    регистрации на информационных площадках Службы, в частности, в одной из следующих групп
                                    мессенджера «WhatsApp»: «Арбайт грузчики/рабочие»; «Арбайт2 грузчики/рабочие»; «Арбайт3
                                    грузчики/рабочие»; «Арбайт200 грузчики/рабочие». Регистрацию Партнёр может пройти по
                                    месту
                                    нахождения офиса Службы или самостоятельно с использованием сети Интернет.
                                </li>
                                <li>Регистрация Партнёра на информационных площадках Службы подтверждает полное и
                                    безоговорочное
                                    принятие условий настоящей оферты.
                                </li>
                                <li>Регистрация Партнёра осуществляется посредством предоставления сведений о себе по месту
                                    нахождения офиса Службы или удалённо с использованием сети Интернет. Предоставление
                                    сведений
                                    Партнёром удалённо с использованием сети Интернет осуществляется путём направления
                                    Партнёром
                                    со своего телефонного номера с помощью Интернет-мессенджера WhatsApp на телефонный номер
                                    Службы (Индивидуального предпринимателя Фёдорова Дмитрия Сергеевича) +7 951 000 22 34
                                    электронного сообщения с подтверждением принятия условий настоящей оферты, а также с
                                    сообщением своих данных в следующем объёме: фамилия, имя, отчество, дата рождения, адрес
                                    места жительства, номер сотового телефона. В процессе регистрации Служба может попросить
                                    Партнёра предоставить документы (электронные образы (сканы) документов), подтверждающие
                                    достоверность указанных сведений.
                                </li>
                                <li>Регистрация осуществляется по усмотрению Службы. Предоставление документов и сведений,
                                    необходимых для регистрации, не влечет за собой безусловную обязанность Службы
                                    произвести
                                    регистрацию Партнёра.
                                </li>
                                <li>Процедура регистрации завершается и подтверждается внесением в информационную базу
                                    Службы
                                    информации о Партнёре, как о лице самостоятельно, своими силами оказывающему услуги по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги разнорабочих.
                                </li>
                                <li>Копии и (или) электронные образы документов в процессе регистрации Служба истребует
                                    исключительно в целях проверки достоверности предоставляемых
                                    сведений и не сохраняет после завершения процедуры регистрации.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Осуществление расчётов между Заказчиком и Партнёром</span>
                            <ol class="offer-sub">
                                <li>Служба предоставляет Заказчику услуги, предмет которых определён настоящей офертой, на
                                    безвозмездной основе.
                                </li>
                                <li>Расчёт за оказание услуг по грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или)
                                    услуг разнорабочих осуществляется непосредственно между Заказчиком и Партнёром. Служба
                                    информирует Заказчика о стоимости оказания услуг. Указанная стоимость рассчитывается на
                                    основании тарифов, применяемых Партнёром, принявшим заказ к исполнению. Информирование
                                    Заказчика об окончательной стоимости услуг не свидетельствует и не может расцениваться
                                    как
                                    то, что услуги по грузоперевозкам и (или) погрузо-разгрузочным работам, и (или) услуги
                                    разнорабочих предоставляются Службой.
                                </li>
                                <li>Форма осуществления расчетов за оказание услуг по грузоперевозкам и (или)
                                    погрузо-разгрузочным работам, и (или) услуг разнорабочих согласуется непосредственно
                                    Заказчиком и Партнёром без участия Службы.
                                </li>
                                <li>Служба не даёт Заказчику и Партнеру каких-либо указаний относительно формы и порядка
                                    расчетов за оказанные услуги по грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или) услуг разнорабочих.
                                </li>
                                <li>Служба может обеспечить техническую возможность для оплаты Заказчиком услуг Партнёра по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и
                                    (или) услуг разнорабочих в форме безналичного платежа (при наличии технической
                                    возможности).
                                </li>
                                <li>При расчетах между Заказчиком и Партнёром безналичным платежом Служба может выступать в
                                    качестве агента Партнёра, действующего от имени и за счет
                                    Партнёра, в части приёма денежных средств Заказчика. Служба может принять на себя
                                    обязательства агента Партнера только в части обеспечения приёма
                                    денежных средств Заказчика.
                                </li>
                                <li>Оплата безналичным платежом может осуществляться посредством кредитных или дебетовых
                                    карт платёжных систем Visa, MasterCard, «Мир» или переводом
                                    на расчётный счёт.
                                </li>
                                <li>Оплата безналичным платежом с использованием банковских карт осуществляется в
                                    соответствии с правилами международных платежных систем на принципах
                                    соблюдения конфиденциальности и безопасности совершения платежа. Безопасность
                                    предоставляемых Заказчиком данных обеспечивается соответствием
                                    процедур требованиям стандарта безопасности данных индустрии платежных карт (Payment
                                    Card Industry Data Security Standard), и никто, включая
                                    Службу, не может их получить. Ввод данных банковской карты осуществляется на защищенной
                                    платежной странице банка-эквайера, обеспечивающего
                                    возможность безналичной оплаты услуг.
                                </li>
                                <li>В случае изменения Заказчиком объема заказанных Партнёру услуг (изменение маршрута,
                                    объёма погрузо-разгрузочных или иных работ, оказание Партнёром
                                    Заказчику дополнительных платных услуг и т.д.) стоимость подлежит перерасчету. Заказ
                                    оплачивается Заказчиком в соответствии с объёмом фактически
                                    оказанных Партнёром услуг.
                                </li>
                                <li>Заказчик и Партнёр вправе согласовать любые формы расчетов за оказание услуг по
                                    грузоперевозкам и (или) погрузо-разгрузочным работам, и (или)
                                    услуг разнорабочих, в том числе, оплату услуг наличными денежными средствами и иными
                                    способами, не противоречащими действующему законодательству.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Осуществление расчётов между Партнёром и Службой</span>
                            <ol class="offer-sub">
                                <li>Оплата информационных услуг Службы осуществляется Партнёром в размере определённого
                                    процента
                                    от общей суммы оплаты Партнёру от Заказчика за исполнение заказа.
                                </li>
                                <li>Размер процента определяется Службой индивидуально по каждому заказу и сообщается
                                    Службой
                                    Партнёрам одновременно с размещением информации о заказе Заказчика в информационной базе
                                    Службы.
                                </li>
                                <li>Партнёр, принявший заказ Заказчика к исполнению с помощью информационных услуг Службы,
                                    одновременно принимает на себя обязательство оплатить информационные услуги Службы в
                                    определённом Службой размере процента от общей суммы оплаты Партнёру от Заказчика за
                                    исполнение заказа.
                                </li>
                                <li>Партнёр, который принимает заказ к исполнению, уведомляет о своем выборе Службу, после
                                    чего
                                    оплачивает информационные услуги Службы в определённом Службой размере процента от общей
                                    суммы оплаты Партнёру от Заказчика за исполнение заказа. После поступления оплаты от
                                    Партнёра за предоставление информационных услуг по заказу Служба предоставляет Партнёру
                                    контактную информацию Заказчика, а также информирует Заказчика о Партнёре, принявшем
                                    заказ к
                                    исполнению.
                                </li>
                                <li>Оплата информационных услуг может производиться Партнёром Службе как в наличном, так и в
                                    безналичном порядке.
                                </li>
                                <li>Оплата безналичным платежом может осуществляться посредством кредитных или дебетовых
                                    карт
                                    платёжных систем Visa, MasterCard, «Мир» или переводом на расчётный счёт Службы.
                                </li>
                                <li>Оплата безналичным платежом с использованием банковских карт осуществляется в
                                    соответствии с правилами международных платежных систем на принципах
                                    соблюдения конфиденциальности и безопасности совершения платежа. Безопасность
                                    предоставляемых Партнёром данных обеспечивается соответствием
                                    процедур требованиям стандарта безопасности данных индустрии платежных карт (Payment
                                    Card Industry Data Security Standard), и никто, включая
                                    Службу, не может их получить. Ввод данных банковской карты осуществляется на защищенной
                                    платежной странице банка-эквайера, обеспечивающего
                                    возможность безналичной оплаты услуг.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Ответственность Сторон</span>
                            <ol class="offer-sub">
                                <li>Стороны несут ответственность за невыполнение своих обязательств в соответствии с
                                    законодательством Российской Федерации и условиями настоящей оферты.
                                </li>
                                <li>Служба не несёт ответственность за перерывы в оказании услуг в случае сбоев программного
                                    обеспечения или оборудования, обеспечивающего доступ к сети Интернет.
                                </li>
                                <li>Служба не несёт ответственность за полные или частичные прерывания оказания услуг,
                                    связанные
                                    с заменой оборудования, программного обеспечения или проведением других работ, вызванных
                                    необходимостью поддержания работоспособности и развития технических средств Службы.
                                </li>
                                <li>Служба не несёт ответственность за прямые убытки, упущенную выгоду, понесённые
                                    Заказчиком в
                                    результате пользования услугами Партнёров по грузоперевозкам и (или)
                                    погрузо-разгрузочным
                                    работам, и (или) услугами разнорабочих.
                                </li>
                                <li>Служба не несёт ответственность за неисполнение Партнёром своих обязательств перед
                                    Заказчиком.
                                </li>
                                <li>Регистрация Партнёра в информационной базе Службы может быть прекращена Службой в
                                    следующих
                                    случаях:
                                    <ol>
                                        <li>если Партнёр не исполнил принятый к исполнению заказ Заказчика;</li>
                                        <li>если Партнёр допустил некорректное поведение (неуважительное отношение,
                                            грубость,
                                            ненормативная лексика) по отношению к сотрудникам Службы и (или) Заказчику;
                                        </li>
                                        <li>если Партнёр не оплатил информационные услуги Службы в определённом Службой
                                            размере процента от общей суммы оплаты Партнёру от Заказчика
                                            за исполнение заказа.
                                        </li>
                                    </ol>
                                    В случае прекращения регистрации по данным основаниям регистрация Партнёра может быть
                                    восстановлена Службой в случае принятия Партнёром на себя
                                    обязательства не допускать таких действий (бездействия) в дальнейшем; а также в случае
                                    полной оплаты Партнёром оказанных ему ранее информационных
                                    услуг Службы. Восстановление регистрации в информационной базе Службы осуществляется на
                                    возмездной основе и оплачивается Партнёром в сумме 400 руб.
                                </li>
                                <li>В случае наличия уважительных причин невозможности исполнить в назначенное время заказ
                                    Заказчика, принятый Партнёром к исполнению, Партнёр должен
                                    заблаговременно сообщить об этом Заказчику и Службе, чтобы Служба имела возможность
                                    повторно внести информацию о заказе Заказчика в информационную
                                    систему и обеспечить возможность другим Партнёрам принять заказ Заказчика к исполнению.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Ответственность Сторон</span>
                            <ol class="offer-sub">
                                <li>Порядок изменения и расторжения договора, разрешения споров</li>
                                <li>Договор, заключённый путём акцепта настоящей оферты, может быть изменён или расторгнут
                                    по
                                    соглашению Сторон.
                                </li>
                                <li>Ситуации, не урегулированные настоящей офертой, разрешаются в соответствии с действующим
                                    законодательством Российской Федерации.
                                </li>
                                <li>Споры и разногласия, связанные с исполнением настоящей оферты, Стороны будут разрешать
                                    путем
                                    переговоров.
                                </li>
                                <li>В случае невозможности урегулирования споров путем переговоров они подлежат разрешению в
                                    соответствии с действующим законодательством Российской
                                    Федерации.
                                </li>
                            </ol>
                        </li>
                        <li><span class="offer-bold">Дополнительные условия</span>
                            <ol class="offer-sub">
                                <li>Соглашаясь с условиями оферты в настоящей редакции, Заказчики и Партнёры выражают свое
                                    согласие на получение информационных сообщений, а также
                                    рекламной информации (в том числе, посредством сообщений через интернет-мессенджеры),
                                    распространяемой по сетям связи в целях и случаях, когда
                                    необходимость такого согласия предусмотрена законодательством Российской Федерации о
                                    рекламе.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </div>

                <p>
                    <checkbox
                            name="terms"
                            v-model="checkbox"
                            style="padding-left:10%"
                    >
                        С офертой согласен.
                    </checkbox>
                </p>
                <div style="padding-left:30.8%">
                    <button id="proceed" class="btn btn-default" v-bind:disabled="!checkbox"
                        @onclick="saveProgressAndGoToRules()"
                    >
                            Продолжить
                    </button>
                </div>
            </div>
        </section>
    </div>
</template>

<script>
    export default {
        name: "offer",
        data() {
            return {
                yes: 0,
                no: 0,
                name: "Вниз",
                id: "proceed",
                checkbox: 0,
                start: true,
                user_type: ''
            }
        },

        mounted: function () {
            this.user_type = this.$route.params.user_type;
        },

        methods: {
            onScrollDone() {
                document.getElementById('scroll').style.display = "none";
            },

            saveProgressAndGoToRules() {
                var success = true;
                var app = this;

                this.$axios.post(
                    'save-progress',
                    {
                        view: 'offer',
                        user_type: app.user_type
                    }
                ).
                catch(function (resp) {
                    alert("Возникла ошибка. Возможно нет связи с сервером, проверьте интернет");
                    success = false;
                });

                if (success) {
                    this.$router.push({
                        name: 'rules',
                        params: {user_type: app.user_type}
                    });
                }
            }
        }
    }
</script>

<style scoped>
    #scroll {
        background-color: #000;
        border-radius: 50%;
        bottom: 50px;
        color: #f4f009;
        font-size: 16px;
        height: 50px;
        line-height: 50px;
        outline: 0;
        position: fixed;
        right: 50px;
        text-align: center;
        width: 50px;
    }
</style>