<template>
    <section id="worker">
        <div class="worker-wrapper col-xs-12">
            <div>
                <p>
                    Регистрация завершена. Прочитайте правила рабочего процесса и
                    правила поведения в группе. После этого вы получите ссылку на вступление в группу whatsapp.
                </p>
                <p>
                    В группе диспетчеры скидывают заявки. Берете заявку, если она вас устраивает,
                    пишете диспетчеру личным сообщением, либо в чате: я/беру/+ . Когда диспетчер закрывает заявку,
                    он часто пишет последние 4 цифры номера телефона рабочего : "Закрыта, едет 8899" или "закрыта в личке".
                    Если написал просто "закрыта" и вам не сказал ехать, не скинул деталей, не дал телефона клиента -
                    значит вы не едите, а едет другой рабочий.
                </p>
                <p>
                    У вас обязательно должен быть телефон для обычной связи! Если телефон в вотсапе и обычный отличаются,
                    вы должны об этом сообщить диспетчеру. Если ваш телефон на половину или более разряжен,
                    сообщите об этом диспетчеру.
                </p>
                <p>
                    Если идете на заявку не вы, а вместо вас идет ваш друг или кто-то другой обязательно сообщайте об
                    этом и указывайте телефон того, кто пойдёт.
                    Затем диспетчер в личном сообщении объясняет вам что делать - кому звонить, сколько будет за час
                    на руки денег от клиента и т.д. Если вам дают деньги наличкой, то с нее вам нужно
                    завести % диспетчеру, обычно это 50 или 100 рублей в час (ваши 200/225/250 в час).
                    Если вы не переводите комиссию диспетчеру, то будете удалены и попадаете в черный список,
                    и всем диспетчерам это будет известно.
                </p>
                <div class="page-subtitle-wrapper">
                    <h3>Правила рабочего процесса</h3>
                </div>
                <p>
                    <b>Правило 1.</b> Если вы взяли заявку и не вышли (проспали, потерялись, не доехали) -
                    удаление из группы и снижение вашей репутации. Чтобы такого не было, <u>сообщайте заранее</u>,
                    что не сможете приехать: за 2 часа или вечером до заявки. Если заявка утренняя (раньше 11),
                    сообщайте вечером не позднее 22:00 ! Если заявка взята позже 22, то не позднее, чем через час после взятия.
                    <u>Возвращение в группу происходит на возмездной основе: 200 рублей.</u>

                </p>
                <p>
                    <b>Правило 2.</b> Если вы взяли заявку, то за 2 часа до заявки - будьте на связи!
                    Если вы не вышли на связь, то это нарушение <u>правила 1</u> и вас удаляют из группы и происходит снижение
                    репутации. Если есть проблемы со связью - сообщайте заранее.
                    <u>Возвращение в группу происходит на возмездной основе: 200 рублей.</u>
                </p>
                <p>
                    <b>Правило 3.</b> Если вы вышли на заявку, то отработайте до конца.
                    В случае ухода с заявки, вас удаляют из группы и происходит снижение репутации.
                    Поэтому, если вы не уверены в том, что доработаете до конца - не берите заявку!
                    Исключение составляют только случаи, когда информация в заявке сильно расходится с тем,
                    что на самом деле (написано - коробки, а на самом деле - кофейный аппарат или мешки 50 кг).
                    Незначительные неточности допускаются и это не повод уходить с заявки.
                    <u>Возвращение в группу происходит на возмездной основе: 200 рублей.</u>
                </p>
                <p>
                    <b>Правило 4.</b> Если вы взяли заявку на время через 2 часа и более (или завтра, например),
                    то должны прибыть за 10 минут до начала заявки.
                    За опоздание от 15 до 30 минут от начала заявки - удаление и снижение репутации.
                    Опоздание более 30 минут  считается как не выход на заявку.
                    Если далеко ехать, обязательно предупреждайте об этом диспетчера и выходите заранее!
                    <u>Возвращение в группу происходит на возмездной основе:</u>
                    <ol class="offer-sub">
                        <li>100 рублей за опоздание от 15 до 30 минут.</li>
                        <li>200 рублей за опоздание от 30 минут.</li>
                    </ol>
                </p>
                <p>
                    <b>Правило 5.</b> Субординация в общении с диспетчерами группы.
                    За наезды, маты, хамство в сторону диспетчера : удаление на срок от 1 до 7 дней на усмотрение диспетчера.
                </p>
                <p>
                    <b>Правило 6.</b> Субординация в общении с клиентом на заявке.
                    За наезды, маты, хамство в сторону клиента : удаление на срок от 1 до 7 дней на усмотрение диспетчера.
                </p>
                <p>
                    <b>Правило 7.</b> Вы не общаетесь с клиентом о работе, не раздаёте ему свои визитки.
                    Любое общение с клиентом о дальнейшей работе НАПРЯМУЮ, без предупреждения диспетчера,
                    будет классифицироваться как ВОРОВСТВО клиента. В этом случае, вы будете удалены и
                    попадаете в черный список. Все диспетчеры группы Арбайт больше не будут с вами сотрудничать.
                </p>
                <p>
                    <b>Правило 8.</b> Не вернули комиссию диспетчеру - вас удаляют до возврата.
                    И пометка в чёрном списке, все диспетчера будут знать.
                </p>
                <p>
                    В случае нарушений правил, ваша репутация снижается и диспетчеры будут реже
                    давать вам заявки.
                </p>
            </div>
            <p>
                <checkbox name="terms" v-model="checkbox">
                    С правилами ознакомлен и не возражаю.
                </checkbox>
            </p>
            <div style="padding-left:28.8%">
                <button id="proceed" class="btn btn-default" v-bind:disabled="!checkbox">
                    <router-link v-bind:class="{ disabled: !checkbox }" :to="{ name: 'invitation' }"
                                 style="width: 100%; height: 100%; display: block;">
                        Завершить
                    </router-link>
                </button>
            </div>
        </div>
    </section>
</template>

<script>
    export default {
        name: "registration-done",
        data: function () {
            return {
                start: true,
                display: true,
                nationality: 0,
                RF_citizen: false,
                alien_citizen: false,
                route_name: ''
            }
        },
        methods: {
            onRadioClick() {
                if (this.nationality == 1) {
                    this.route_name = 'register-worker';
                }
                else if (this.nationality == 2) {
                    this.route_name = 'register-alien-worker';
                }
            }
        },
        mounted(){
        }
    }
</script>

<style scoped>
    .disabled {
        pointer-events:none;
        opacity:0.6;
    }

    .center1 {
        font-size: 170%;
        position: fixed;
        top: 30%;
        left: 10%;
        transfrom: translateY(-30%);
        transfrom: translateX(-10%);
    }

    .center2 {
        font-size: 170%;
        position: fixed;
        top: 40%;
        left: 10%;
        transfrom: translateY(-40%);
        transfrom: translateX(-10%);
    }

    .center3 {
        font-size: 130%;
        position: fixed;
        top: 60%;
        left: 10%;
        transfrom: translateY(-60%);
        transfrom: translateX(-10%);
    }

    .center4 {
        font-size: 130%;
        position: fixed;
        top: 60%;
        left: 45%;
        transfrom: translateY(-60%);
        transfrom: translateX(-45%);
    }

    #worker {
        font-size: 130%;
    }

    #proceed {
        font-size: 120%;
    }
</style>