<template>
    <section id="worker">
        <div class="worker-wrapper col-xs-12">
            <div>
                <p>

                </p>
                <p>
                    В группе Я (Дмитрий) и мой коллега Глеб скидываем заявки. Берете заявку, если она вас устраивает,
                    пишете диспетчеру личным сообщением, либо в чате: я/беру/+ . Когда диспетчер закрывает заявку,
                    он может написать последние 4 цифры номера телефона рабочего : "Закрыто, едет 8899" или
                    "закрыто в личке". Если написал просто закрыто и вам не сказал ехать, не скинул деталей, не дал
                    телефона клиента - значит вы не едите, а едет другой рабочий.
                </p>
                <p>
                    У вас обязательно должен быть телефон для обычной связи! Если телефон в вотсапе и обычный отличаются,
                    вы должны об этом сообщить диспетчеру. Если ваш телефон на половину или более разряжен,
                    сообщите об этом диспетчеру.
                </p>
                <p>
                    Если идете на заявку не вы, а вместо вас идет ваш друг или кто-то другой обязательно сообщайте об
                    этом и указывайте телефон того, кто пойдёт.
                    Затем диспетчер в личном сообщении объясняет вам что делать - кому звонить, сколько будет за час на
                    руки денег от клиента и т.д. Если вам дают деньги наличкой, то с нее вам обязвтельно нужно завести
                    % диспетчеру, обычно это 50 или 100 рублей в час (ваши 200/225/250 в час). Если вы не переводите
                    комиссию диспетчеру, то автоматом попадаете в черный список и мы с вами больше не сотрудничаем.
                </p>
                <div class="page-subtitle-wrapper">
                    <h3>Правила рабочего процесса</h3>
                </div>
                <p>
                    <b>Правило 1.</b> Если вы взяли заявку и не вышли (проспали, потерялись, не доехали) -
                    удаление из группы и снижение вашей репутации. Чтобы такого не было, <u>сообщайте заранее</u>,
                    что не сможете приехать: за 2 часа или вечером до заявки. Если заявка утренняя (раньше 11),
                    сообщайте вечером не позднее 22:00 ! Если заявка взята позже 22, то не позднее, чем через час после взятия.

                </p>
                <p>
                    <b>Правило 2.</b> Если вы взяли заявку, то за 2 часа до заявки - будьте на связи!
                    Если есть проблемы со связью или садится батарея - сообщайте заранее, еще до того как вы туда поехали.
                </p>
                <p>
                    <b>Правило 3.</b>Если вы вышли на заявку, то отработайте до конца. Поэтому,
                    если вы не уверены в том, что доработаете до конца - не берите заявку!
                    Исключение составляют только случаи, вы заранее предупредили, что вам нужно уйти в такое-то время.
                </p>
                <p>
                    <b>Правило 4.</b> Если вы взяли заявку на время через 2 часа и более (или завтра, например),
                    то должны прибыть за 10 минут до начала заявки.
                    За опоздание от 15 до 30 минут от начала заявки - снижение репутации.
                    Опоздание более 30 минут считается как невыход на заявку.
                    Если далеко ехать, обязательно предупреждайте об этом диспетчера и выходите заранее!
                </p>
                <p>
                    <b>Правило 5.</b> Субординация в общении с диспетчерами группы.
                    За наезды, маты, хамство в сторону диспетчера : удаление на срок от 1 до 7 дней
                    на усмотрение диспетчера.
                    За угрозы - "Я тебя найду. Я тебя убью. Я тебя зарежу" и т.д. удаление навсегда!
                </p>
                <p>
                    <b>Правило 6.</b> Субординация в общении с клиентом на заявке.
                    За наезды, маты, хамство в сторону клиента : удаление на срок от 1 до 7 дней на усмотрение диспетчера.
                </p>
                <p>
                    <b>Правило 7.</b> Вы не общаетесь с клиентом о работе, не раздаёте ему свои визитки.
                    Любое общение с клиентом о дальнейшей работе НАПРЯМУЮ, без предупреждения диспетчера,
                    будет классифицироваться как ВОРОВСТВО клиента. В этом случае, вы будете удалены и
                    попадаете в черный список. Все диспетчеры группы Арбайт больше не будут с вами сотрудничать.
                </p>
                <p>
                    <b>Правило 8.</b> Не вернули комиссию диспетчеру - вас удаляют до возврата.
                    И пометка в чёрном списке, все диспетчеры будут об этом знать.
                </p>
                <p>
                    В случае нарушений правил, ваша репутация снижается и мы будем реже
                    давать вам заявки.
                </p>
                <p>
                    <u>Если вы соблюдаете правила, то ваша репутация растет и вам будут чаще давать заявки.</u>
                </p>
                <p>
                    <u>
                        В случае нарушения правил № 1, 2, 3 и 4 (опоздание более 30 минут), вы будете
                        удалены из группы, возвращение в группу происходит на возмездной основе,
                        стоимость которой составляет 200 рублей.
                    </u>
                </p>
            </div>
            <p>
                <checkbox name="terms" v-model="checkbox">
                    С правилами ознакомлен и не возражаю.
                </checkbox>
            </p>

        </div>
    </section>
</template>

<script>
    export default {
        name: "rules",
        data: function () {
            return {
                start: true,
                display: true,
                checkbox: 0,
            }
        },
        methods: {
        },
        mounted(){
        }
    }
</script>

<style scoped>
    .disabled {
        pointer-events:none;
        opacity:0.6;
    }

    #worker {
        font-size: 130%;
    }

    #proceed {
        font-size: 120%;
        width: 150px;
        height: 70px;
        text-align: center;
    }
</style>