<template>
    <section class="skills_howto">
        <div class="container">
            <h3>Инструкция по выбору навыков</h3>
            <p>
                На следующем экране укажите ваш уровень владения специальностями, которые вы уже выбрали.
                Каждая специальность содержит навыки. Нужно нажимать на эти навыки, чтобы выбрать уровень владения.
                Как только вы определите уровни всех навыков, появится кнопка “Далее”.
            </p>
            <p>
                При нажатии по бесцветному навыку, он меняет цвет на зелёный.
                Это значит, что у вас есть опыт применения данного навыка, вы им владеете.
                При нажатии еще раз по навыку, он меняет цвет на синий. Это значит, что вы владеете этим навыком как профессионал.
            </p>
            <p>
                Убедительная просьба быть честными! Это поможет нам искать только подходящую работу для Вас!
            </p>
        </div>
        <div class="occu-buttons">
            <button class="btn btn-default" type="submit"><router-link :to="{ name: 'skills-howto' }">ОК</router-link></button>
        </div>
    </section>
</template>

<script>
    export default {
        name: "skills-how-to"
    }
</script>

<style scoped>

</style>